Revit 2018 API
TextElement.VerticalAlignment Property
 Vertical alignment of the text content within the text area of the element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Since: 2016
Syntax
C#
public VerticalTextAlignment VerticalAlignment { get; }
Visual Basic
Public ReadOnly Property VerticalAlignment As VerticalTextAlignment
	Get
Visual C++
public:
property VerticalTextAlignment VerticalAlignment {
	VerticalTextAlignment get ();
}
Remarks
 This is a read-only property. In all but a very few cases the value of vertical text alignment is only set to be VerticalTextAlignment.Top.
See Also
TextElement Class
Autodesk.Revit.DB Namespace